---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.LargeFamilyFile
source: html/e1c15eb8-63c3-7d9a-b917-7f72cf49523d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.PerformanceFailures.LargeFamilyFile Property

Family occupies XXX kilobytes of memory. Consider simplification of the family.

## Syntax (C#)
```csharp
public static FailureDefinitionId LargeFamilyFile { get; }
```